Бухгалтерские_задачи_Занятие_5/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>ПодразделениеОтправитель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бухгалтерские_задачи_Занятие_5/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаМСФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Занятие_5/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ДвиженияДенежныхСредств</types>
    <types>CatalogRef.Договоры</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПоступлениеТоваров</types>
    <types>DocumentRef.РучнаяОперация</types>
  </type>
  <predefined>
    <items>
      <name>ДвиженияДенежныхСредств</name>
      <description>Движения денежных средств</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.ДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партия</name>
      <description>Партия</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.РучнаяОперация</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерские_задачи_Занятие_5/src/Documents/ПеремещениеТоваров/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
		, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	
		Индекс = ПроверяемыеРеквизиты.Найти("ПодразделениеОтправитель");
		ПроверяемыеРеквизиты.Удалить(Индекс);
		
		Индекс = ПроверяемыеРеквизиты.Найти("ПодразделениеПолучатель");
		ПроверяемыеРеквизиты.Удалить(Индекс);
	
	КонецЕсли;                      
	
	
	Если ПолучитьФункциональнуюОпцию("УчетПоСкладам") = Ложь Тогда
		
		ПроверяемыеРеквизиты.Добавить("СкладОтправитель");
		ПроверяемыеРеквизиты.Добавить("СкладПолучатель");
		
	КонецЕсли;                      
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	//В учебных целях (для упрощения) делаем допущение, что складской учет ведется.
	
	//--ОЧИСТКА ДВИЖЕНИЙ ЭТОГО ДОКУМЕНТА В БАЗЕ ДАННЫХ
	
	Движения.Проводки.Записывать = Истина;
	Движения.Записать();
	
	//--БЛОКИРОВКА
	
	Блокировка = Новый БлокировкаДанных;
	
	ЧтоБлокируем = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	ЧтоБлокируем.Режим = РежимБлокировкиДанных.Исключительный;
	
	Для каждого ТекСтрока Из Товары Цикл
		
		ЧтоБлокируем.УстановитьЗначение("Счет", ТекСтрока.СчетУчета);
		ЧтоБлокируем.УстановитьЗначение("Организация", Организация);
		ЧтоБлокируем.УстановитьЗначение("Подразделение", ПодразделениеОтправитель);
		
		Если ТекСтрока.СчетУчета.ВидыСубконто.Получить(0).ВидСубконто 
			= ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
			
			ЧтоБлокируем.УстановитьЗначение("Субконто1", ТекСтрока.Номенклатура);
			ЧтоБлокируем.УстановитьЗначение("Субконто2", СкладОтправитель);
			
		Иначе
			
			ЧтоБлокируем.УстановитьЗначение("Субконто1", СкладОтправитель);
			ЧтоБлокируем.УстановитьЗначение("Субконто2", ТекСтрока.Номенклатура);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	
	// ---  ЗАПРОС
	
	ПорядокСубконто = Новый Массив;
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПорядокСубконто", ПорядокСубконто);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("Склад", СкладОтправитель);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОтправитель);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.СчетУчета,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТДокумент
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.СчетУчета,
	|	ПеремещениеТоваровТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроводкиОстатки.Счет,
	|	ПроводкиОстатки.Субконто1,
	|	ПроводкиОстатки.СуммаОстатокДт,
	|	ПроводкиОстатки.КоличествоОстатокДт
	|ПОМЕСТИТЬ ВТОстаткиСклад
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТДокумент.СчетУчета
	|				ИЗ
	|					ВТДокумент КАК ВТДокумент),
	|			&ПорядокСубконто,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И Субконто2 = &Склад
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ВТДокумент.Номенклатура
	|					ИЗ
	|						ВТДокумент КАК ВТДокумент)) КАК ПроводкиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокумент.Номенклатура,
	|	ВТДокумент.СчетУчета,
	|	ВТДокумент.Количество КАК ДокКол,
	|	ЕСТЬNULL(ВТОстаткиСклад.КоличествоОстатокДт, 0) КАК РегКол
	|ИЗ
	|	ВТДокумент КАК ВТДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиСклад КАК ВТОстаткиСклад
	|		ПО ВТДокумент.СчетУчета = ВТОстаткиСклад.Счет
	|			И ВТДокумент.Номенклатура = ВТОстаткиСклад.Субконто1";
	
	
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//--ПРОВЕРКА НАЛИЧИЯ УЧТЕННОГО ТМЦ ПО СЧЕТУ НА СКЛАДЕ
		
		Нехватка = Выборка.ДокКол - Выборка.РегКол;
		
		Если Нехватка > 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = "Для проведения по данным бухгалтерского учета по счету "
			+ Выборка.СчетУчета + " на складе " + СкладОтправитель + " не хватает номенклатуры """
			+ Выборка.Номенклатура + """. Нехватка составляет " + Нехватка + " ед.";
			
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		Движения.Проводки.Записывать = Истина;
		
		Для каждого ТекСтрокаТовары Из Товары Цикл
			
			Движение = Движения.Проводки.Добавить();
			
			//--Общие для проводки -----
			Движение.Период = Дата;
			//Движение.Сумма = ТекСтрокаТовары.Стоимость;
			Движение.СодержаниеПроводки = "Перемещение ТМЦ";
			Движение.Организация = Организация;
			
			//--Дебет -----
			Движение.СчетДт = ТекСтрокаТовары.НовыйСчетУчета;
			Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение,ПодразделениеПолучатель,"Дт");
			
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Дт");
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", СкладПолучатель, "Дт");
			
			Серверный.ЗаполнитьКоличествоСтороныПроводки(Движение, ТекСтрокаТовары.Количество, "Дт");
			
			//--Кредит ----
			Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
			Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение,ПодразделениеОтправитель,"Кт");
			
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Кт");
			Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", СкладОтправитель, "Кт");
			
			Серверный.ЗаполнитьКоличествоСтороныПроводки(Движение, ТекСтрокаТовары.Количество, "Кт");
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры
